tutorials-OpenFOAM-v1806/multiRegionReactingFoamTutorial/constant/bottomAir/reactions
species
(
    O2
    N2
);

reactions
{
}
