tutorials-OpenFOAM-v1806/multiRegionReactingFoamTutorial/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication splitMeshRegions -cellZones -overwrite

# remove fluid fields from solid regions (important for post-processing)
for i in heater leftSolid rightSolid
do
   rm -f 0*/$i/{nut,alphat,epsilon,k,U,p_rgh,CH4,N2,O2,H2O,CO2,Ydefault}
done


for i in bottomAir topAir heater leftSolid rightSolid
do
    runApplication -s $i  changeDictionary -region $i
done

runApplication refineMesh -region topAir -overwrite


#------------------------------------------------------------------------------
